import "./detail.css";
export default function Detail() {
  return (
    <div className="detail">
      <section className="detail-banner"></section>
      <section className="detail-content">
        <ul className="menu">
        <li className="menu-item">
                <a href="#">导航1</a>
            </li>
            <li className="menu-item">
                <a href="#">导航1</a>
            </li>
            <li className="menu-item">
                <a href="#">导航1</a>
            </li>
            <li className="menu-item">
                <a href="#">导航1</a>
            </li>
            <li className="menu-item">
                <a href="#">导航1</a>
            </li>
            <li className="menu-item">
                <a href="#">导航1</a>
            </li>
        </ul>
        <article className="blog-detail">
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        <h2>为什么要有同源策略</h2>
        <p>
          跨域是指从一个域名的网页去请求另一个域名的资源。比如从百度(baidu.com)页面去请求我的博客(blog.pangao.vip)的资源。但由于有同源策略的关系，一般是不允许这么直接访问的。
          什么是同源策略
        </p>
        <h2>为什么要跨域</h2>
        <p>
          然而，有一些情况下，我们是需要跨域访问的。比如，程序员开发网站，就有可能需要在本地访问服务器的数据。再比如某公司的
          A 页面(a.pangao.vip)有可能需要获取 B 页面(b.pangao.vip)
        </p>
        <h2>跨域问题的 4 种解决方案</h2>
        <p>
          谷歌浏览器有一款允许跨域的插件 Allow CORS:
          Access-Control-Allow-Origin。这款插件可以在 web 应用程序中轻松执行跨域
          Ajax
          请求。请注意，将加载项添加到浏览器时，默认情况下它处于非活动状态（工具栏图标为灰色
          C 字母）。如果要激活加载项，请按一下工具栏上的图标。图标将变为橙色 C
          字母。
        </p>
        </article>
      </section>
    </div>
  );
}
